{
  "Pregnancy_Care": {
    "Early_Pregnancy": {
      "Month_1": {
        "Nutrition": "Start taking folic acid supplements. Consume fresh fruits and vegetables daily.",
        "Lifestyle": "Completely stop smoking and drinking. Reduce caffeine intake."
      },
      "Month_2": {
        "Mental_Preparation": "Gather information about fetal development. Read books or materials about childbirth.",
        "Medical_Consultation": "Visit the obstetrician for the first time, schedule an ultrasound."
      },
      "Month_3": {
        "Exercise": "Start light walking. Consider joining yoga or Pilates classes.",
        "Emotional_Support": "Discuss the birth plan with your partner."
      }
    },
    "Mid_Pregnancy": {
      "Month_4": {
        "Nutrition": "Increase protein intake with meat, fish, and tofu. Increase water intake.",
        "Managing_Physical_Changes": "Consume high-fiber foods to prevent pregnancy-related constipation."
      },
      "Month_5": {
        "Exercise": "Participate in pregnancy yoga classes. Engage in exercises to strengthen your body for weight gain. ",
        "Mental_Preparation": "Listen to prenatal music to foster a bond with the baby."
      },
      "Month_6": {
        "Childbirth_Education": "Enroll in childbirth classes. Practice breathing and relaxation techniques.",
        "Physical_Preparation": "Start shopping for baby supplies, and create a list of essential items."
      }
    },
    "Late_Pregnancy": {
      "Month_7": {
        "Nutrition": "Choose easily digestible foods and have light snacks occasionally.",
        "Birth_Preparation": "Start preparing your hospital bag. Check necessary documents and items."
      },
      "Month_8": {
        "Physical_Care": "Elevate your legs to reduce ankle swelling. Wear comfortable clothing.",
        "Mental_Preparation": "Build a support network for after the birth (family, friends, etc.)."
      },
      "Month_9": {
        "Birth_Plan": "Make final decisions about the hospital and birthing method.",
        "Final_Preparations": "Recheck items needed for the hospital visit."
      }
    },
    "Postpartum": {
      "0-1_Month": {
        "Recovery": "Maintain a balanced diet, focusing on protein and vitamin C. Stay hydrated during breastfeeding.",
        "Emotional_Support": "Seek help from family and friends. Increase skin-to-skin contact with the baby."
      },
      "1-3_Months": {
        "Exercise": "Start light exercise after 6 weeks postpartum. Join postpartum exercise classes.",
        "Regular_Checkups": "Schedule postpartum check-ups with your obstetrician."
      },
      "4-6_Months": {
        "Nutrition": "Introduce a variety of foods to support your baby’s taste development.",
        "Emotional_Support": "Join parenting groups for information sharing and emotional support."
      },
      "7-12_Months": {
        "Exercise": "Maintain physical activity through walks and play with the baby.",
        "Mental_Preparation": "Continue learning about your baby’s growth and development."
      }
    }
  }
}